Repository: lingxi-coder/lingxi-app
Catalog: clients/ios/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

# local_apps_filter
source: 筛选
en: Filter
ja: フィルター
ko: 필터
zh_hant: 篩選

# local_apps_filter_all
source: 全部
en: All
ja: すべて
ko: 전체

# local_apps_history_notice
source: 恢复只回退 Git 管理的源码，SQLite 数据不会回滚。恢复前会自动创建 pre_restore 检查点。
en: Restoring only rolls back Git-managed source code; SQLite data is not rolled back. A pre_restore checkpoint is created automatically before restoring.
ja: 復元は Git で管理されたソースコードのみを巻き戻し、SQLite データはロールバックされません。復元前に pre_restore チェックポイントが自動的に作成されます。
ko: 복원은 Git으로 관리되는 소스 코드만 되돌리며, SQLite 데이터는 되돌아가지 않습니다. 복원 전에 pre_restore 체크포인트가 자동으로 생성됩니다.
zh_hant: 恢復只回退 Git 管理的原始碼，SQLite 資料不會回滾。恢復前會自動建立 pre_restore 檢查點。

# local_apps_ignore
source: 忽略
en: Ignore
ja: 無視
ko: 무시

# local_apps_leave_app_detail
source: 此链接将交给系统浏览器打开： %1$s
en: This link will be opened in the system browser: %1$s
ja: このリンクはシステムのブラウザで開きます： %1$s
ko: 이 링크는 시스템 브라우저에서 열립니다: %1$s
zh_hant: 此連結將交給系統瀏覽器開啟： %1$s

# local_apps_leave_app_title
source: 离开本地应用？
en: Leave the local app?
ja: ローカルアプリを離れますか？
ko: 로컬 앱을 나가시겠습니까?
zh_hant: 離開本地應用？

# local_apps_line_per_item
source: 每行一项
en: One item per line
ja: 1 行につき 1 項目
ko: 한 줄에 한 항목씩
zh_hant: 每行一項

# local_apps_loading_data_detail
source: 应用详情返回后会显示受控 SQLite 集合。
en: Managed SQLite collections will show once the app details return.
ja: アプリの詳細が返却されると、制御された SQLite コレクションが表示されます。
ko: 앱 세부 정보가 반환되면 제어된 SQLite 컬렉션이 표시됩니다.
zh_hant: 應用詳情返回後會顯示受控 SQLite 集合。

# local_apps_loading_data_title
source: 正在加载数据结构
en: Loading data structure
ja: データ構造を読み込み中
ko: 데이터 구조를 불러오는 중
zh_hant: 正在載入資料結構

# local_apps_loading_generic
source: 加载中
en: Loading
ja: 読み込み中
ko: 불러오는 중
zh_hant: 載入中

# local_apps_loading_workspace_detail
source: 应用详情返回后会显示可编辑源码。
en: Editable source code will show once the app details return.
ja: アプリの詳細が返却されると、編集可能なソースコードが表示されます。
ko: 앱 세부 정보가 반환되면 편집 가능한 소스 코드가 표시됩니다.
zh_hant: 應用詳情返回後會顯示可編輯原始碼。

# local_apps_loading_workspace_title
source: 正在加载工作区
en: Loading workspace
ja: ワークスペースを読み込み中
ko: 작업 공간을 불러오는 중
zh_hant: 正在載入工作區

# local_apps_manifest_domains_title
source: 清单声明的 HTTPS 域名
en: HTTPS domains declared in the manifest
ja: マニフェストで宣言された HTTPS ドメイン
ko: 매니페스트에 명시된 HTTPS 도메인
zh_hant: 清單宣告的 HTTPS 域名

# local_apps_mode_direct
source: Direct · Next 本地服务
en: Direct · Next local service
ja: Direct · Next ローカルサービス
ko: Direct · Next 로컬 서비스
zh_hant: Direct · Next 本地服務

# local_apps_mode_direct_detail
source: 使用生产构建，运行实例受设备内存配额控制。
en: Uses a production build; running instances are governed by the device's memory quota.
ja: プロダクションビルドを使用し、実行インスタンスはデバイスのメモリクォータによって制御されます。
ko: 프로덕션 빌드를 사용하며, 실행 인스턴스는 기기 메모리 할당량의 제한을 받습니다.
zh_hant: 使用生產建置，執行例項受裝置記憶體配額控制。

# local_apps_mode_play
source: Play · 静态应用
en: Play · Static app
ja: Play · 静的アプリ
ko: Play · 정적 앱
zh_hant: Play · 靜態應用

# local_apps_mode_play_detail
source: 使用已校验的静态导出产物。
en: Uses a verified static export build.
ja: 検証済みの静的エクスポート成果物を使用します。
ko: 검증된 정적 내보내기 결과물을 사용합니다.
zh_hant: 使用已校驗的靜態匯出產物。

# local_apps_more
source: 更多
en: More
ja: その他
ko: 더 보기

# local_apps_name
source: 应用名称
en: App Name
ja: アプリ名
ko: 앱 이름
zh_hant: 應用名稱

# local_apps_new_field_default_label
source: 新字段
en: New field
ja: 新しいフィールド
ko: 새 필드
zh_hant: 新欄位

# local_apps_next
source: 下一步
en: Next
ja: 次へ
ko: 다음

# local_apps_no_checkpoints
source: 暂无检查点
en: No checkpoints yet
ja: チェックポイントはまだありません
ko: 체크포인트가 없습니다
zh_hant: 暫無檢查點

# local_apps_no_checkpoints_detail
source: 尚无检查点。
en: No checkpoints yet.
ja: チェックポイントはまだありません。
ko: 아직 체크포인트가 없습니다.
zh_hant: 尚無檢查點。

# local_apps_no_collections
source: 此应用未声明持久化集合。
en: This app has not declared any persistent collections.
ja: このアプリは永続化コレクションを宣言していません。
ko: 이 앱은 영구 컬렉션을 선언하지 않았습니다.
zh_hant: 此應用未宣告持久化集合。

# local_apps_no_domains_detail
source: 无（默认 CSP 禁止外网）
en: None (the default CSP blocks external network access)
ja: なし（デフォルトの CSP は外部ネットワークを禁止）
ko: 없음 (기본 CSP가 외부 네트워크를 차단합니다)
zh_hant: 無（預設 CSP 禁止外網）

# local_apps_not_found
source: 应用不存在
en: App not found
ja: アプリが見つかりません
ko: 앱이 존재하지 않습니다
zh_hant: 應用不存在

# local_apps_not_running_detail
source: 启动后可在此预览。
en: You can preview here once it's started.
ja: 起動するとここでプレビューできます。
ko: 시작한 후 여기서 미리 볼 수 있습니다.
zh_hant: 啟動後可在此預覽。

# local_apps_not_running_title
source: 应用尚未运行
en: The app isn't running yet
ja: アプリはまだ実行されていません
ko: 앱이 아직 실행되지 않았습니다
zh_hant: 應用尚未執行

# local_apps_open_preview
source: 打开预览
en: Open Preview
ja: プレビューを開く
ko: 미리보기 열기
zh_hant: 開啟預覽

# local_apps_permission_data_mutation
source: 允许 Agent 修改应用数据？
en: Allow the agent to modify app data?
ja: Agent によるアプリデータの変更を許可しますか？
ko: 에이전트가 앱 데이터를 수정하도록 허용하시겠습니까?
zh_hant: 允許 Agent 修改應用資料？

# local_apps_permission_data_mutation_plain
source: 允许修改应用数据？
en: Allow modifying app data?
ja: アプリデータの変更を許可しますか？
ko: 앱 데이터 수정을 허용하시겠습니까?
zh_hant: 允許修改應用資料？

# local_apps_permission_mutation_requires
source: 修改数据或控制 UI 首次需要授权
en: Modifying data or controlling the UI requires authorization the first time
ja: データの変更や UI の操作には初回のみ許可が必要です
ko: 데이터 수정이나 UI 제어는 처음에 권한이 필요합니다
zh_hant: 修改資料或控制 UI 首次需要授權

# local_apps_permission_network
source: 允许应用访问网络？
en: Allow this app to access the network?
ja: アプリのネットワークアクセスを許可しますか？
ko: 앱의 네트워크 접근을 허용하시겠습니까?
zh_hant: 允許應用存取網路？

# local_apps_permission_network_default
source: 默认禁止外网
en: External network access is blocked by default
ja: デフォルトでは外部ネットワークへのアクセスは禁止されています
ko: 기본적으로 외부 네트워크는 차단됩니다
zh_hant: 預設禁止外網

# local_apps_permission_network_detail
source: 仅可访问设计清单声明的 HTTPS 域名，每个域名首次访问单独授权。
en: Only HTTPS domains declared in the design manifest can be accessed, and each domain requires separate authorization on first use.
ja: デザイン仕様で宣言された HTTPS ドメインにのみアクセスでき、各ドメインは初回アクセス時に個別に許可が必要です。
ko: 디자인 매니페스트에 명시된 HTTPS 도메인만 접근할 수 있으며, 도메인별로 처음 접근할 때 개별적으로 권한을 요청합니다.
zh_hant: 僅可存取設計清單宣告的 HTTPS 域名，每個域名首次存取單獨授權。

# local_apps_permission_network_short
source: 允许应用联网？
en: Allow the app to access the network?
ja: アプリのネットワーク接続を許可しますか？
ko: 앱의 네트워크 연결을 허용하시겠습니까?
zh_hant: 允許應用聯網？

# local_apps_permission_read_default
source: 读取数据与检查 UI 默认允许
en: Reading data and inspecting the UI are allowed by default
ja: データの読み取りと UI の検査はデフォルトで許可されています
ko: 데이터 읽기와 UI 확인은 기본적으로 허용됩니다
zh_hant: 讀取資料與檢查 UI 預設允許

# local_apps_permission_restore
source: 允许恢复代码检查点？
en: Allow restoring this code checkpoint?
ja: コードのチェックポイントへの復元を許可しますか？
ko: 코드 체크포인트 복원을 허용하시겠습니까?
zh_hant: 允許恢復程式碼檢查點？

# local_apps_permission_ui_action %@
source: 允许界面操作：%@？
en: Allow UI action: %@?
ja: UI 操作を許可しますか：%@？
ko: 화면 조작을 허용하시겠습니까: %@?
zh_hant: 允許介面操作：%@？

# local_apps_permission_ui_control
source: 允许 Agent 控制应用界面？
en: Allow the agent to control the app's UI?
ja: Agent によるアプリ UI の操作を許可しますか？
ko: 에이전트가 앱 화면을 제어하도록 허용하시겠습니까?
zh_hant: 允許 Agent 控制應用介面？

# local_apps_permissions_reset
source: 撤销全部授权
en: Revoke All Permissions
ja: すべての許可を取り消す
ko: 모든 권한 취소
zh_hant: 撤銷全部授權

# local_apps_permissions_reset_confirm
source: 撤销会话与持久授权
en: Revoke session and persistent permissions
ja: セッション権限と永続的な権限を取り消す
ko: 세션 및 영구 권한 취소
zh_hant: 撤銷會話與持久授權

# local_apps_permissions_reset_confirm_detail
source: 会话授权和持久授权都会清除。下次修改数据、控制界面或访问域名时会重新询问。
en: Both session and persistent authorizations will be cleared. You'll be asked again the next time the app modifies data, controls the UI, or accesses a domain.
ja: セッション権限と永続的な権限の両方がクリアされます。次回データを変更したり、UI を操作したり、ドメインにアクセスする際に再度確認します。
ko: 세션 권한과 영구 권한이 모두 지워집니다. 다음에 데이터를 수정하거나 화면을 제어하거나 도메인에 접근할 때 다시 물어봅니다.
zh_hant: 會話授權和持久授權都會清除。下次修改資料、控制介面或存取域名時會重新詢問。

# local_apps_permissions_reset_detail
source: 下次修改数据、控制界面或访问域名时会重新询问。
en: You'll be asked again next time the app modifies data, controls the UI, or accesses a domain.
ja: 次回データを変更したり、UI を操作したり、ドメインにアクセスする際に再度確認します。
ko: 다음에 데이터를 수정하거나 화면을 제어하거나 도메인에 접근할 때 다시 물어봅니다.
zh_hant: 下次修改資料、控制介面或存取域名時會重新詢問。

# local_apps_permissions_reset_title
source: 撤销该应用的全部授权？
en: Revoke all permissions for this app?
ja: このアプリのすべての許可を取り消しますか？
ko: 이 앱의 모든 권한을 취소하시겠습니까?
zh_hant: 撤銷該應用的全部授權？

# local_apps_permissions_title
source: 应用授权
en: App Permissions
ja: アプリの権限
ko: 앱 권한
zh_hant: 應用授權

# local_apps_please_select
source: 请选择
en: Please Select
ja: 選択してください
ko: 선택해 주세요
zh_hant: 請選擇

# local_apps_preview_confirm_title
source: 预览确认
en: Preview Confirmation
ja: プレビューの確認
ko: 미리보기 확인
zh_hant: 預覽確認

# local_apps_preview_not_ready
source: 预览尚未准备好
en: Preview isn't ready yet
ja: プレビューはまだ準備できていません
ko: 미리보기가 아직 준비되지 않았습니다
zh_hant: 預覽尚未準備好

# local_apps_preview_not_ready_detail
source: 预览服务尚未就绪，仍可批准或提交修改。
en: The preview service isn't ready yet; you can still approve or submit changes.
ja: プレビューサービスはまだ準備できていませんが、変更の承認や送信は引き続き可能です。
ko: 미리보기 서비스가 아직 준비되지 않았지만, 수정 사항은 여전히 승인하거나 제출할 수 있습니다.
zh_hant: 預覽服務尚未就緒，仍可批准或提交修改。

# local_apps_preview_not_running
source: 预览尚未运行
en: Preview isn't running yet
ja: プレビューはまだ実行されていません
ko: 미리보기가 실행 중이 아닙니다
zh_hant: 預覽尚未執行

# local_apps_preview_not_running_detail
source: 启动应用后，页面将从 Rust 回环服务加载。
en: Once the app starts, the page will load from the Rust loopback service.
ja: アプリを起動すると、ページは Rust のループバックサービスから読み込まれます。
ko: 앱을 시작하면 Rust 로컬 서비스에서 페이지를 불러옵니다.
zh_hant: 啟動應用後，頁面將從 Rust 迴環服務載入。

# local_apps_preview_title
source: 应用预览
en: App preview
ja: アプリプレビュー
ko: 앱 미리보기
zh_hant: 應用預覽

# local_apps_previous
source: 上一步
en: Previous
ja: 前へ
ko: 이전

# local_apps_process_exited
source: 本地应用进程已退出
en: The local app process has exited
ja: ローカルアプリのプロセスが終了しました
ko: 로컬 앱 프로세스가 종료되었습니다
zh_hant: 本地應用行程已退出

# local_apps_refresh
source: 刷新应用
en: Refresh Apps
ja: アプリを更新
ko: 앱 새로고침
zh_hant: 重新整理應用

# local_apps_request_suggestion
source: 让 Agent 提出设计建议
en: Ask the Agent for design suggestions
ja: Agent にデザインの提案を求める
ko: 에이전트에게 디자인 제안 요청
zh_hant: 讓 Agent 提出設計建議

# local_apps_required_suffix
source: · 必填
en: · Required
ja: · 必須
ko: · 필수

# local_apps_restart
source: 重新启动
en: Restart
ja: 再起動
ko: 다시 시작
zh_hant: 重新啟動

# local_apps_restore_checkpoint_confirm_detail
source: 将恢复到“%1$s”。当前源码会先保存为 pre_restore，应用数据保持不变。
en: This will restore to “%1$s”. The current source will first be saved as pre_restore; app data stays unchanged.
ja: 「%1$s」に復元します。現在のソースコードは先に pre_restore として保存され、アプリのデータは変更されません。
ko: "%1$s"(으)로 복원됩니다. 현재 소스 코드는 먼저 pre_restore로 저장되며, 앱 데이터는 그대로 유지됩니다.
zh_hant: 將恢復到「%1$s」。當前原始碼會先儲存為 pre_restore，應用資料保持不變。

# local_apps_restore_checkpoint_confirm_title
source: 恢复源码检查点？
en: Restore the source code checkpoint?
ja: ソースコードのチェックポイントを復元しますか？
ko: 소스 코드 체크포인트를 복원하시겠습니까?
zh_hant: 恢復原始碼檢查點？

# local_apps_restore_checkpoint_detail
source: 恢复前会自动创建 pre_restore 检查点。应用数据库不会回滚。
en: A pre_restore checkpoint is created automatically before restoring. The app's database won't be rolled back.
ja: 復元前に pre_restore チェックポイントが自動的に作成されます。アプリのデータベースはロールバックされません。
ko: 복원 전에 pre_restore 체크포인트가 자동으로 생성됩니다. 앱 데이터베이스는 되돌아가지 않습니다.
zh_hant: 恢復前會自動建立 pre_restore 檢查點。應用資料庫不會回滾。

# local_apps_restore_checkpoint_title
source: 恢复代码检查点？
en: Restore this code checkpoint?
ja: コードのチェックポイントを復元しますか？
ko: 코드 체크포인트를 복원하시겠습니까?
zh_hant: 恢復程式碼檢查點？

# local_apps_restore_code
source: 恢复代码
en: Restore Code
ja: コードを復元
ko: 코드 복원
zh_hant: 恢復程式碼

# local_apps_retry_generate
source: 重试生成
en: Retry Generation
ja: 生成を再試行
ko: 다시 생성
zh_hant: 重試生成

# local_apps_revoke_action
source: 撤销
en: Revoke
ja: 取り消す
ko: 취소
zh_hant: 撤銷

# local_apps_row_actions %@
source: %@ 操作
en: %@ actions
ja: %@ の操作
ko: %@ 작업

# local_apps_runtime_failed %@
source: 运行失败 · %@
en: Run failed · %@
ja: 実行失敗 · %@
ko: 실행 실패 · %@
zh_hant: 執行失敗 · %@

# local_apps_runtime_footer %@
source: %@ · 依赖由 Lingxi 固定管理
en: %@ · Dependencies pinned and managed by Lingxi
ja: %@ · 依存関係は Lingxi が固定管理
ko: %@ · 의존성은 Lingxi가 고정 버전으로 관리합니다
zh_hant: %@ · 依賴由 Lingxi 固定管理

# local_apps_runtime_log_mode
source: 模式：%1$s
en: Mode: %1$s
ja: モード：%1$s
ko: 모드: %1$s

# local_apps_runtime_log_none
source: 当前没有运行错误。完整构建日志保存在应用 logs 目录，并可由受控 MCP read_logs 查询。
en: There are no runtime errors right now. Full build logs are stored in the app's logs directory and can be queried via the managed MCP read_logs tool.
ja: 現在、実行エラーはありません。完全なビルドログはアプリの logs ディレクトリに保存されており、制御された MCP の read_logs で照会できます。
ko: 현재 실행 오류가 없습니다. 전체 빌드 로그는 앱 logs 디렉터리에 저장되며, 제어된 MCP read_logs로 조회할 수 있습니다.
zh_hant: 當前沒有執行錯誤。完整建置日誌儲存在應用 logs 目錄，並可由受控 MCP read_logs 查詢。

# local_apps_runtime_log_recovery
source: 恢复：%1$s
en: Recovery: %1$s
ja: 復旧：%1$s
ko: 복구: %1$s
zh_hant: 恢復：%1$s

# local_apps_runtime_log_status
source: 状态：%1$s
en: Status: %1$s
ja: 状態：%1$s
ko: 상태: %1$s
zh_hant: 狀態：%1$s

# local_apps_runtime_log_title
source: 运行日志
en: Runtime log
ja: 実行ログ
ko: 실행 로그
zh_hant: 執行日誌

# local_apps_runtime_mode
source: 运行模式
en: Run Mode
ja: 実行モード
ko: 실행 모드
zh_hant: 執行模式

# local_apps_runtime_next
source: Next 本地服务
en: Next.js Local Server
ja: Next ローカルサービス
ko: Next 로컬 서비스
zh_hant: Next 本地服務

# local_apps_runtime_notice_staged_after_null
source: 本地应用运行时已准备就绪，但本次启动中曾有一次引擎构建没能拿到它。引擎只在启动时读取一次运行时路径：如果失败原因是运行时不可用，请重启 App 后重试；否则本次失败与运行时无关。
en: The local-app runtime is ready, but during this launch one engine build failed to pick it up. The engine reads the runtime path only once at launch: if the failure was caused by the runtime being unavailable, restart the app and try again; otherwise this failure is unrelated to the runtime.
ja: ローカルアプリのランタイムは準備できていますが、今回の起動中に一度、エンジンのビルドがそれを取得できませんでした。エンジンは起動時に一度だけランタイムパスを読み込みます。失敗の原因がランタイムの利用不可によるものであれば、アプリを再起動してから再試行してください。それ以外の場合、今回の失敗はランタイムとは無関係です。
ko: 로컬 앱 런타임이 준비되었지만, 이번 시작 중 한 번의 엔진 빌드에서 이를 받지 못했습니다. 엔진은 시작할 때 한 번만 런타임 경로를 읽습니다. 실패 원인이 런타임을 사용할 수 없어서라면 앱을 재시작한 후 다시 시도해 주세요. 그렇지 않다면 이번 실패는 런타임과 관련이 없습니다.
zh_hant: 本地應用執行時已準備就緒，但本次啟動中曾有一次引擎建置沒能拿到它。引擎只在啟動時讀取一次執行時路徑：如果失敗原因是執行時不可用，請重啟 App 後重試；否則本次失敗與執行時無關。

# local_apps_runtime_notice_staging
source: 本地应用运行时仍在首次准备中。引擎只在启动时读取一次运行时路径，因此准备完成后需要重启 App 才能生成应用。
en: The local-app runtime is still being prepared for the first time. The engine reads the runtime path only once at launch, so you'll need to restart the app after preparation finishes before you can generate apps.
ja: ローカルアプリのランタイムは、まだ初回の準備中です。エンジンは起動時に一度だけランタイムパスを読み込むため、準備が完了したらアプリを再起動しないとアプリを生成できません。
ko: 로컬 앱 런타임이 아직 최초 준비 중입니다. 엔진은 시작할 때 한 번만 런타임 경로를 읽으므로, 준비가 끝나면 앱을 재시작해야 앱을 생성할 수 있습니다.
zh_hant: 本地應用執行時仍在首次準備中。引擎只在啟動時讀取一次執行時路徑，因此準備完成後需要重啟 App 才能生成應用。

# local_apps_runtime_notice_unavailable
source: 本地应用运行时准备失败（安装包中没有运行时，或解压失败），本次启动无法生成应用。
en: The local-app runtime failed to prepare (the install package has no runtime, or extraction failed); apps can't be generated during this launch.
ja: ローカルアプリのランタイムの準備に失敗しました（インストールパッケージにランタイムが含まれていないか、展開に失敗しました）。今回の起動ではアプリを生成できません。
ko: 로컬 앱 런타임 준비에 실패했습니다(설치 패키지에 런타임이 없거나 압축 해제에 실패). 이번 실행에서는 앱을 생성할 수 없습니다.
zh_hant: 本地應用執行時準備失敗（安裝包中沒有執行時，或解壓失敗），本次啟動無法生成應用。

# local_apps_runtime_running
source: 运行中
en: Running
ja: 実行中
ko: 실행 중
zh_hant: 執行中

# local_apps_runtime_starting
source: 正在启动
en: Starting
ja: 起動中
ko: 시작하는 중
zh_hant: 正在啟動

# local_apps_runtime_static
source: 静态运行
en: Static
ja: 静的実行
ko: 정적 실행
zh_hant: 靜態執行

# local_apps_runtime_stopped
source: 已停止
en: Stopped
ja: 停止済み
ko: 중지됨

# local_apps_runtime_stopping
source: 正在停止
en: Stopping
ja: 停止中
ko: 중지하는 중

# local_apps_runtime_suspended %@
source: 已挂起 · %@
en: Suspended · %@
ja: 一時停止 · %@
ko: 일시 중단됨 · %@
zh_hant: 已掛起 · %@

# local_apps_runtime_suspended_plain
source: 已挂起
en: Suspended
ja: 一時停止
ko: 일시 중단됨
zh_hant: 已掛起

# local_apps_saved_message
source: 已保存。下次生成或构建会校验依赖和源码策略。
en: Saved. Dependencies and source policy will be validated on the next generation or build.
ja: 保存しました。次回の生成やビルド時に依存関係とソースコードポリシーを検証します。
ko: 저장되었습니다. 다음 생성 또는 빌드에서 의존성과 소스 코드 정책을 검증합니다.
zh_hant: 已儲存。下次生成或建置會校驗依賴和原始碼策略。

# local_apps_search
source: 搜索应用
en: Search Apps
ja: アプリを検索
ko: 앱 검색
zh_hant: 搜尋應用

# local_apps_search_prompt
source: 搜索应用或状态
en: Search apps or status
ja: アプリまたは状態を検索
ko: 앱 또는 상태 검색
zh_hant: 搜尋應用或狀態

# local_apps_section_agent
source: Agent 控制
en: Agent Control
ja: Agent 制御
ko: 에이전트 제어

# local_apps_section_app_id
source: 应用标识
en: App ID
ja: アプリ ID
ko: 앱 식별자
zh_hant: 應用標識

# local_apps_section_code
source: 代码
en: Code
ja: コード
ko: 코드
zh_hant: 程式碼

# local_apps_section_data
source: 数据
en: Data
ja: データ
ko: 데이터
zh_hant: 資料

# local_apps_section_history
source: 历史
en: History
ja: 履歴
ko: 이력
zh_hant: 歷史

# local_apps_section_network
source: 网络
en: Network
ja: ネットワーク
ko: 네트워크
zh_hant: 網路

# local_apps_section_overview
source: 概览
en: Overview
ja: 概要
ko: 개요
zh_hant: 概覽

# local_apps_section_permissions
source: 权限
en: Permissions
ja: 権限
ko: 권한
zh_hant: 權限

# local_apps_section_permissions_logs
source: 权限/日志
en: Permissions/Logs
ja: 権限／ログ
ko: 권한/로그
zh_hant: 權限/日誌

# local_apps_section_preview
source: 预览
en: Preview
ja: プレビュー
ko: 미리보기
zh_hant: 預覽

# local_apps_source
source: 源码
en: Source
ja: ソースコード
ko: 소스 코드
zh_hant: 原始碼

# local_apps_source_browser_notice
source: 仅显示 1 MiB 以内的文本源码；符号链接、构建产物和私有目录已排除。依赖文件可编辑，但不受支持的版本会在构建校验时被拒绝。
en: Only text source under 1 MiB is shown; symlinks, build artifacts, and private directories are excluded. Dependency files are editable, but unsupported versions are rejected during build verification.
ja: 1 MiB 以内のテキストソースコードのみを表示します。シンボリックリンク、ビルド成果物、非公開ディレクトリは除外されています。依存関係ファイルは編集できますが、サポート対象外のバージョンはビルド検証時に拒否されます。
ko: 1 MiB 이하의 텍스트 소스 코드만 표시됩니다. 심볼릭 링크, 빌드 결과물, 비공개 디렉터리는 제외됩니다. 의존성 파일은 편집할 수 있지만, 지원되지 않는 버전은 빌드 검증 시 거부됩니다.
zh_hant: 僅顯示 1 MiB 以內的文字原始碼；符號連結、建置產物和私有目錄已排除。依賴檔案可編輯，但不受支援的版本會在建置校驗時被拒絕。

# local_apps_source_detail
source: 可查看和编辑完整文本源码；符号链接、构建产物和工作区外路径不会显示。修改固定依赖可以保存，但构建验证会拒绝不受支持的版本或安装操作。
en: View and edit the full text source; symlinks, build artifacts, and paths outside the workspace aren't shown. Changes to pinned dependencies can be saved, but build validation will reject unsupported versions or installs.
ja: 完全なテキストソースコードの閲覧・編集ができます。シンボリックリンク、ビルド成果物、ワークスペース外のパスは表示されません。固定された依存関係の変更は保存できますが、サポート対象外のバージョンやインストール操作はビルド検証で拒否されます。
ko: 전체 텍스트 소스 코드를 보고 편집할 수 있습니다. 심볼릭 링크, 빌드 결과물, 작업 공간 밖의 경로는 표시되지 않습니다. 고정 의존성 수정 사항은 저장할 수 있지만, 빌드 검증에서 지원되지 않는 버전이나 설치 작업은 거부됩니다.
zh_hant: 可檢視和編輯完整文字原始碼；符號連結、建置產物和工作區外路徑不會顯示。修改固定依賴可以儲存，但建置驗證會拒絕不受支援的版本或安裝操作。

# local_apps_source_empty
source: 暂无可编辑源码
en: No editable source yet
ja: 編集可能なソースコードはまだありません
ko: 편집 가능한 소스 코드가 없습니다
zh_hant: 暫無可編輯原始碼

# local_apps_source_error_title
source: 源码错误
en: Source Error
ja: ソースコードエラー
ko: 소스 코드 오류
zh_hant: 原始碼錯誤

# local_apps_source_loading
source: 正在读取源码…
en: Loading source…
ja: ソースコードを読み込み中…
ko: 소스 코드를 불러오는 중…
zh_hant: 正在讀取原始碼…

# local_apps_source_no_editable_files
source: 暂无可编辑源码。
en: No editable source code yet.
ja: 編集可能なソースコードはまだありません。
ko: 편집 가능한 소스 코드가 없습니다.
zh_hant: 暫無可編輯原始碼。

# local_apps_source_saved_message
source: 已保存；下次构建会重新校验源码。
en: Saved; the source code will be re-verified on the next build.
ja: 保存しました。次回のビルド時にソースコードを再検証します。
ko: 저장되었습니다. 다음 빌드에서 소스 코드를 다시 검증합니다.
zh_hant: 已儲存；下次建置會重新校驗原始碼。

# local_apps_step_progress
source: 步骤 %1$d / %2$d
en: Step %1$d / %2$d
ja: ステップ %1$d / %2$d
ko: 단계 %1$d / %2$d
zh_hant: 步驟 %1$d / %2$d

# local_apps_submit
source: 提交
en: Submit
ja: 送信
ko: 제출

# local_apps_submit_to_agent
source: 提交给 Agent
en: Submit to Agent
ja: Agent に送信
ko: 에이전트에게 제출
zh_hant: 提交給 Agent

# local_apps_suggestion_default_summary
source: 建议调整 %1$d 个字段
en: Suggests adjusting %1$d fields
ja: %1$d 個のフィールドの調整を提案
ko: %1$d개 필드 수정 제안
zh_hant: 建議調整 %1$d 個欄位

# local_apps_suggestion_note
source: Agent 建议调整以下设计字段
en: The agent suggests adjusting the following design fields
ja: Agent が以下のデザインフィールドの調整を提案しています
ko: 에이전트가 다음 디자인 필드 수정을 제안합니다
zh_hant: Agent 建議調整以下設計欄位

# local_apps_suspension_background
source: 进入后台
en: Entered Background
ja: バックグラウンドに移行
ko: 백그라운드 진입
zh_hant: 進入背景

# local_apps_suspension_exited
source: 进程已退出
en: Process Exited
ja: プロセスが終了しました
ko: 프로세스 종료됨
zh_hant: 行程已退出

# local_apps_suspension_memory
source: 内存压力
en: Memory Pressure
ja: メモリ不足
ko: 메모리 압박
zh_hant: 記憶體壓力

# local_apps_suspension_quota
source: 运行配额
en: Runtime Quota
ja: 実行クォータ
ko: 실행 할당량
zh_hant: 執行配額

# local_apps_template
source: 模板
en: Template
ja: テンプレート
ko: 템플릿

# local_apps_template_meta
source: %1$d 步 · 模板 v%2$s
en: %1$d steps · Template v%2$s
ja: %1$d ステップ · テンプレート v%2$s
ko: %1$d단계 · 템플릿 v%2$s

# local_apps_template_steps %lld %llu
source: %lld 个设计步骤 · v%llu
en: %lld design steps · v%llu
ja: デザインステップ %lld 個 · v%llu
ko: 디자인 단계 %lld개 · v%llu
zh_hant: %lld 個設計步驟 · v%llu

# local_apps_templates_all
source: 全部模板
en: All Templates
ja: すべてのテンプレート
ko: 전체 템플릿

# local_apps_templates_loading
source: 正在读取模板
en: Loading templates
ja: テンプレートを読み込み中
ko: 템플릿을 불러오는 중
zh_hant: 正在讀取模板

# local_apps_templates_loading_detail
source: 模板结构由 Rust AppService 下发，客户端不会使用内置字段副本。
en: Template structure is delivered by the Rust AppService — the client never uses a built-in copy of the fields.
ja: テンプレート構造は Rust AppService から配信され、クライアントは内蔵フィールドのコピーを使用しません。
ko: 템플릿 구조는 Rust AppService에서 전달되며, 클라이언트는 내장된 필드 사본을 사용하지 않습니다.
zh_hant: 模板結構由 Rust AppService 下發，客戶端不會使用內建欄位副本。

# local_apps_templates_not_loaded
source: 模板尚未从本地引擎加载
en: Templates haven't loaded from the local engine yet
ja: テンプレートはまだローカルエンジンから読み込まれていません
ko: 템플릿이 아직 로컬 엔진에서 로드되지 않았습니다
zh_hant: 模板尚未從本地引擎載入

# local_apps_templates_title
source: 选择模板
en: Choose a Template
ja: テンプレートを選択
ko: 템플릿 선택
zh_hant: 選擇模板

# local_apps_title
source: 应用
en: Apps
ja: アプリ
ko: 앱
zh_hant: 應用

# local_apps_ui_action_back
source: 返回
en: Back
ja: 戻る
ko: 뒤로

# local_apps_ui_action_click
source: 点击
en: Click
ja: クリック
ko: 클릭
zh_hant: 點選

# local_apps_ui_action_fill
source: 填写
en: Fill
ja: 入力
ko: 입력
zh_hant: 填寫

# local_apps_ui_action_inspect
source: 检查界面
en: Inspect UI
ja: UI を検査
ko: 화면 검사
zh_hant: 檢查介面

# local_apps_ui_action_missing_target
source: UI 请求缺少有效目标或参数
en: The UI request is missing a valid target or parameters
ja: UI リクエストに有効な対象またはパラメーターがありません
ko: UI 요청에 유효한 대상이나 매개변수가 없습니다
zh_hant: UI 請求缺少有效目標或引數

# local_apps_ui_action_navigate
source: 导航
en: Navigate
ja: ナビゲート
ko: 이동
zh_hant: 導航

# local_apps_ui_action_reason
source: Agent 请求执行 %1$s 操作。
en: The Agent is requesting to perform a %1$s action.
ja: Agent が %1$s 操作の実行を要求しています。
ko: 에이전트가 %1$s 작업 실행을 요청했습니다.
zh_hant: Agent 請求執行 %1$s 操作。

# local_apps_ui_action_reload
source: 重新加载
en: Reload
ja: 再読み込み
ko: 새로고침
zh_hant: 重新載入

# local_apps_ui_action_scroll
source: 滚动
en: Scroll
ja: スクロール
ko: 스크롤
zh_hant: 滾動

# local_apps_ui_action_select
source: 选择
en: Select
ja: 選択
ko: 선택
zh_hant: 選擇

# local_apps_ui_action_toggle
source: 切换
en: Toggle
ja: 切り替え
ko: 전환
zh_hant: 切換

# local_apps_ui_reason
source: Agent 请求执行结构化界面操作。
en: The agent requested a structured UI action.
ja: Agent が構造化された UI 操作の実行を要求しています。
ko: 에이전트가 구조화된 화면 조작 실행을 요청했습니다.
zh_hant: Agent 請求執行結構化介面操作。

# local_apps_ui_reason_target %@
source: Agent 请求对 %@ 执行结构化界面操作。
en: The agent requested a structured UI action on %@.
ja: Agent が %@ に対して構造化された UI 操作の実行を要求しています。
ko: 에이전트가 %@에 대한 구조화된 화면 조작 실행을 요청했습니다.
zh_hant: Agent 請求對 %@ 執行結構化介面操作。

# local_apps_updated_at
source: 更新时间
en: Updated
ja: 更新日時
ko: 업데이트 시간
zh_hant: 更新時間

# local_apps_view_all
source: 查看全部应用
en: View All Apps
ja: すべてのアプリを見る
ko: 모든 앱 보기
zh_hant: 檢視全部應用

# local_apps_workflow_awaiting_preview
source: 等待批准预览
en: Awaiting Preview Approval
ja: プレビューの承認待ち
ko: 미리보기 승인 대기 중
zh_hant: 等待批准預覽

# local_apps_workflow_awaiting_preview_label
source: 待批准预览
en: Awaiting preview approval
ja: プレビューの承認待ち
ko: 미리보기 승인 대기
zh_hant: 待批准預覽

# local_apps_workflow_awaiting_spec
source: 等待确认设计
en: Awaiting Design Confirmation
ja: デザインの確認待ち
ko: 디자인 확인 대기 중
zh_hant: 等待確認設計

# local_apps_workflow_awaiting_spec_confirm
source: 待确认设计
en: Awaiting design confirmation
ja: デザインの確認待ち
ko: 디자인 확인 대기
zh_hant: 待確認設計

# local_apps_workflow_collecting_spec
source: 设计中
en: Designing
ja: デザイン中
ko: 디자인 중
zh_hant: 設計中

# local_apps_workflow_generating
source: 正在生成
en: Generating
ja: 生成中
ko: 생성하는 중

# local_apps_workflow_generation_failed
source: 生成失败
en: Generation Failed
ja: 生成失敗
ko: 생성 실패
zh_hant: 生成失敗

# local_apps_workflow_ready
source: 可运行
en: Ready to Run
ja: 実行可能
ko: 실행 가능
zh_hant: 可執行

# local_apps_workflow_revising
source: 正在修改
en: Revising
ja: 修正中
ko: 수정하는 중

# local_apps_workflow_revising_label
source: 修改中
en: Revising
ja: 修正中
ko: 수정 중

# local_apps_workflow_validating
source: 正在校验
en: Validating
ja: 検証中
ko: 검증하는 중
zh_hant: 正在校驗

# local_apps_workflow_validating_label
source: 校验中
en: Validating
ja: 検証中
ko: 검증 중
zh_hant: 校驗中
